#01 Importing Libraries

In [1]:
#Import Libraries
import pandas as pd
import numpy as np
import os

#02 Import Data

In [2]:
# define path to Original Data folder
originalDataPath= r'C:\Users\user\nycpayrollanalysis\02 Data\originaldata'

In [3]:
#define path to prepared data folder
preparedDataPath= r'C:\Users\user\nycpayrollanalysis\02 Data\prepareddata'

In [4]:
#create dataframe with dataset from nyc.gov
df=pd.read_csv(os.path.join(originalDataPath,'Citywide_Payroll_Data__Fiscal_Year_.csv'),index_col=False,dtype=str)

#output shows there is mixed data types, therefore I imported all data as str.  As part of data cleaning, I must confirm data types.

#03 Exploratory Analysis to determine columns and variables, size of data set, shape, info, describe

In [ ]:
df.head()

In [ ]:
df.info()

In [5]:
#convert continuous data to float64
df['Base Salary'] = df['Base Salary'].astype('float64')

In [6]:
df['Regular Hours'] = df['Regular Hours'].astype('float64')
df['Regular Gross Paid'] = df['Regular Gross Paid'].astype('float64')
df['OT Hours'] = df['OT Hours'].astype('float64')
df['Total OT Paid'] = df['Total OT Paid'].astype('float64')
df['Total Other Pay'] = df['Total Other Pay'].astype('float64')

In [ ]:
df.info()

In [7]:
df.describe()

,Base Salary,Regular Hours,Regular Gross Paid,OT Hours,Total OT Paid,Total Other Pay
count,5.109775e+06,5.109775e+06,5.109775e+06,5.109775e+06,5.109775e+06,5.109775e+06
mean,4.434074e+04,6.597381e+02,4.246115e+04,6.298963e+01,3.336576e+03,2.915953e+03
std,4.294908e+04,8.857047e+02,4.027641e+04,1.644688e+02,9.421155e+03,6.003723e+03
min,1.000000e-02,-1.872770e+03,-2.054519e+05,-2.090000e+02,-2.649388e+04,-2.815950e+05
25%,3.318000e+01,0.000000e+00,3.185280e+03,0.000000e+00,0.000000e+00,0.000000e+00
50%,4.250000e+04,0.000000e+00,3.571858e+04,0.000000e+00,0.000000e+00,3.293000e+01
75%,7.922700e+04,1.820000e+03,7.509907e+04,0.000000e+00,1.107000e+02,3.403910e+03
max,4.147070e+05,4.171430e+03,6.723089e+05,3.692900e+03,2.559999e+05,6.500000e+05

#output shows there are min values below zero for hours worked and amount paid.  must confirm if this is bad data or if it appears regularly in data set

In [ ]:
df_neg = df[(df[['Regular Hours', 'Regular Gross Paid','OT Hours','Total Other Pay']] <0)]
#(df[['a', 'b']] != 0)

In [ ]:
df_pos = df[(df[['Regular Hours', 'Regular Gross Paid','OT Hours','Total Other Pay']] > 0)]

In [ ]:
df_neg.shape

In [ ]:
df_pos.shape

In [ ]:
df_neg_reghours = df[df['Regular Hours']<0]

In [ ]:
df_neg_reghours.shape

In [ ]:
df_neg_reghours.head()

In [ ]:
df_neg_reghours['Work Location Borough'].value_counts(dropna=False)

In [ ]:
df_neg_reghours['Title Description'].value_counts(dropna=False)

In [ ]:
df_neg_reghours['OT Hours'].value_counts(dropna=False)

In [ ]:
#output shows 2706 rows with negative regular hours -- this is less than 1% data, consider to remove

In [ ]:
df_neg_reggrosspaid = df[df['Regular Gross Paid']<0]

In [ ]:
df_neg_reggrosspaid.shape

In [ ]:
df_neg_reggrosspaid.head()

In [ ]:
df_neg_othours = df[df['OT Hours']<0]

In [ ]:
df_neg_othours.shape

In [ ]:
df_neg_otpaid = df[df['Total OT Paid']<0]

In [ ]:
df_neg_otpaid.shape

In [ ]:
df_neg_totalotherpay = df[df['Total Other Pay']<0]

In [ ]:
df_neg_totalotherpay.shape

In [ ]:
#determine %total data with negative values
(2706+9129+471+2215+54731)/5109775
5109775-2706-9129

#total rows with negative values is 1.35% of data.
The data dictionary provided by the NYC Open Data website does not have a clear explanation for why there are negative values in these columns.
Therefore I will create subsets of the original dataset to remove the rows with negative values.

In [ ]:
#remove negative Regular Hours values
df_pos_reghours = df[df['Regular Hours'] >=0]

In [ ]:
df_pos_reghours.shape

In [ ]:
#check rows with neg Reg Gross Paid in new df
df_test = df_pos_reghours[df_pos_reghours['Regular Gross Paid'] < 0]

In [ ]:
df_test.shape

In [ ]:
#number rows next subset should have
5107069-7206

In [ ]:
#continue subsetting remove Reg Gross Paid
df_pos_reggrosspaid = df_pos_reghours[df_pos_reghours['Regular Gross Paid'] >= 0]

In [ ]:
df_pos_reggrosspaid.shape

In [ ]:
#check rows with neg OT Hours in new dataframe
df_test= df_pos_reggrosspaid[df_pos_reggrosspaid['OT Hours']<0]

In [ ]:
df_test.shape

In [ ]:
#number of rows for next subset
5099863-337

In [ ]:
df_pos_othours = df_pos_reggrosspaid[df_pos_reggrosspaid['OT Hours'] >=0]

In [ ]:
df_pos_othours.shape

In [ ]:
#check number rows with negative Total OT Paid
df_test = df_pos_othours[df_pos_othours['Total OT Paid']<0]

In [ ]:
df_test.shape

In [ ]:
#number of rows in next subset
5099526 - 1398

In [ ]:
df_pos_totalotpaid = df_pos_othours[df_pos_othours['Total OT Paid'] >=0]

In [ ]:
df_pos_totalotpaid.shape

In [ ]:
#check number of rows with negative Total Other Pay
df_test = df_pos_totalotpaid[df_pos_totalotpaid['Total Other Pay']<0]

In [ ]:
df_test.shape

In [ ]:
#number of rows in next subset
5098128-53284

In [ ]:
df_pos_totalotherpay=df_pos_totalotpaid[df_pos_totalotpaid['Total Other Pay'] >=0]

In [ ]:
df_pos_totalotherpay.shape

In [ ]:
#define path to prepared data folder
preparedDataPath= r'C:\Users\user\nycpayrollanalysis\02 Data\prepareddata'

In [ ]:
#export to view in excel
df_pos_totalotherpay.to_csv(os.path.join(preparedDataPath, 'payroll_no_negs.csv'))

#close and halt at this checkpoint
dataset saved as csv after removing all rows with negative payroll numbers

In [ ]:
#Import data set with no negative payment data

df=pd.read_csv(os.path.join(preparedDataPath,'payroll_no_negs.csv'),index_col=False,dtype=str)

In [ ]:
df.head()

In [ ]:
df.info()

In [ ]:
df.describe()

In [ ]:
#convert payroll variables to float64
df['Base Salary'] = df['Base Salary'].astype('float64')
df['Regular Hours'] = df['Regular Hours'].astype('float64')
df['Regular Gross Paid'] = df['Regular Gross Paid'].astype('float64')
df['OT Hours'] = df['OT Hours'].astype('float64')
df['Total OT Paid'] = df['Total OT Paid'].astype('float64')
df['Total Other Pay'] = df['Total Other Pay'].astype('float64')

In [ ]:
df.describe()

#output shows no negative numbers
#next step identify duplicates

In [8]:
df.duplicated()

0          False
1          False
2          False
3          False
4          False
           ...
5109770    False
5109771    False
5109772    False
5109773    False
5109774    False
Length: 5109775, dtype: bool

In [9]:
df['dup_row']=df.duplicated()

In [10]:
df['dup_row'].value_counts(dropna=False)

False    5109527
True         248
Name: dup_row, dtype: int64

#output shows there are no duplicate rows

#find null values for all strings

In [ ]:
df['Payroll Number'].value_counts(dropna=False)

#Payroll Number contains 1.7million null values which is approx 25% of data. This is too large to remove from total dataset.  Depending on business question in future analysis, it is possible to use subset of data only containing these values.

In [ ]:
df['Agency Name'].value_counts(dropna=False)

In [ ]:
df['Agency Name'].isnull().sum()
#df.isnull().sum()

#output shows there are no null values in Agency Name (great!)

In [ ]:
df['Last Name'].value_counts(dropna=False)

In [ ]:
df['Last Name'].isnull().sum()

In [ ]:
df['First Name'].value_counts(dropna=False)

In [ ]:
df['First Name'].isnull().sum()

In [ ]:
df['Mid Init'].isnull().sum()

In [ ]:
df_nullfullname=df[(df['First Name'].isnull()) & df['Last Name'].isnull()]

In [ ]:
df_nullfullname.shape

#Output shows the following
- 12750 rows contain no name information for employees, this data can be removed from dataset
- Mid Init is missing from approx 50% of the data.  
- Employee name should be replaced with unique identifier based on combination of First Name, Last Name, Mid Init
- Overall, there may be privacy concerns including employee's names in analysis.  Considering this information is made public since they are government employees, it is possible they had to agree to allow their name to be included in this data set.  However, as the analyst, I can choose to protect their privacy within my own analysis.

#Wrangling step - to group data by First Name, Last Name, Mid Init and create new unique identifier.

In [ ]:
#subset data to remove rows with null names
#step 1, create flag for nulls
#ords_prods_merge.loc[(ords_prods_merge['max_order'] <= 40) & (ords_prods_merge['max_order'] > 10), 'loyalty_flag'] = 'Regular customer'
#df['null_name']=df[{(df['First Name'].isnull()) & df['Last Name'].isnull()},true]
df.loc[(df['First Name'].isnull()) & (df['Last Name'].isnull()), 'null_name'] = 'true'

In [ ]:
df['null_name'].value_counts(dropna=False)

In [ ]:
df_nonullname=df[df['null_name'] !='true']

In [ ]:
df_nonullname.shape

In [ ]:
5044844-12750

In [ ]:
df_nonullname.head()

In [ ]:
#unnecessary columns
df_nonullname.drop(columns=['dup_row', 'null_name'])

In [ ]:
df_nonullname.head()

In [ ]:
df_nonullname.shape

In [ ]:
df_nonullname.drop(columns=['dup_row', 'null_name'])

In [ ]:
#export to csv as checkpoint
df_nonullname.to_csv(os.path.join(preparedDataPath, 'payroll_no_negsnullname.csv'))

In [ ]:
#close and halt, reopen with latest data set

In [9]:
#create dataframe with dataset from nyc.gov
df=pd.read_csv(os.path.join(preparedDataPath, 'payroll_no_negsnullname.csv'),dtype=str)

In [10]:
df.head()

,Unnamed: 0,Fiscal Year,Payroll Number,Agency Name,Last Name,First Name,Mid Init,Agency Start Date,Work Location Borough,Title Description,Leave Status as of June 30,Base Salary,Pay Basis,Regular Hours,Regular Gross Paid,OT Hours,Total OT Paid,Total Other Pay,dup_row,null_name
0,0,2020,17,OFFICE OF EMERGENCY MANAGEMENT,BEREZIN,MIKHAIL,NaN,08/10/2015,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,False,NaN
1,1,2020,17,OFFICE OF EMERGENCY MANAGEMENT,GEAGER,VERONICA,M,09/12/2016,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,False,NaN
2,2,2020,17,OFFICE OF EMERGENCY MANAGEMENT,RAMANI,SHRADDHA,NaN,02/22/2016,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,False,NaN
3,3,2020,17,OFFICE OF EMERGENCY MANAGEMENT,ROTTA,JONATHAN,D,09/16/2013,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,False,NaN
4,4,2020,17,OFFICE OF EMERGENCY MANAGEMENT,WILSON II,ROBERT,P,04/30/2018,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,False,NaN

In [11]:
#convert payroll variables to float64
df['Base Salary'] = df['Base Salary'].astype('float64')
df['Regular Hours'] = df['Regular Hours'].astype('float64')
df['Regular Gross Paid'] = df['Regular Gross Paid'].astype('float64')
df['OT Hours'] = df['OT Hours'].astype('float64')
df['Total OT Paid'] = df['Total OT Paid'].astype('float64')
df['Total Other Pay'] = df['Total Other Pay'].astype('float64')

#continue checking for null values

In [13]:
df['Agency Start Date'].value_counts(dropna=False)

01/01/2010    99963
08/30/2007    56023
09/03/2013    55202
09/02/2014    49708
08/31/2006    49534
              ...
01/21/2012        1
03/19/2005        1
03/24/2012        1
12/08/2007        1
01/15/2022        1
Name: Agency Start Date, Length: 15609, dtype: int64

In [14]:
df['Agency Start Date'].isnull().sum()

0

#output shows no null values in Agency Start Date (great!)

In [15]:
df['Work Location Borough'].value_counts(dropna=False)

MANHATTAN        3214253
NaN               503299
QUEENS            490683
BROOKLYN          415033
BRONX             228706
OTHER             106566
RICHMOND           60227
WESTCHESTER         4441
ULSTER              2567
Manhattan           1545
SULLIVAN            1067
Bronx                935
DELAWARE             714
Queens               599
NASSAU               324
PUTNAM               322
SCHOHARIE            232
DUTCHESS             194
ALBANY               117
Richmond             112
GREENE                79
WASHINGTON DC         56
ORANGE                23
Name: Work Location Borough, dtype: int64

#output shows the following items must be fixed
- focus on the 5 boroughs of NYC:  Brooklyn, Manhattan, Queens, Bronx, Staten Island
- Staten Island is Richmond County
- convert all values to all-upper-case
- remove locations not in 5 boroughs - Washington DC, Delaware, Richmond, Westchester, Ulster, Sullivan, Nassua, Putname, Schoharie, Dutchess, Albany, Greene, Orange
- Consider options on how to handle NAN and Other
- convert 'NAN' to 'unknown"

In [41]:
df['Work Location Borough'] = df['Work Location Borough'].astype('str')

In [42]:
df['Work Location Borough'].value_counts(dropna=False)

MANHATTAN        3215798
nan               503299
QUEENS            491282
BROOKLYN          415033
BRONX             229641
OTHER             106566
RICHMOND           60339
WESTCHESTER         4441
ULSTER              2567
SULLIVAN            1067
DELAWARE             714
NASSAU               324
PUTNAM               322
SCHOHARIE            232
DUTCHESS             194
ALBANY               117
GREENE                79
WASHINGTON DC         56
ORANGE                23
Name: Work Location Borough, dtype: int64

In [45]:
df['Work Location Borough']=df['Work Location Borough'].replace(to_replace=['Manhattan','Brooklyn','Queens','Bronx','Richmond','nan'], value=['MANHATTAN','BROOKLYN','QUEENS','BRONX','RICHMOND','UNKNOWN'])

In [25]:
df['Work Location Borough'].value_counts(dropna=False)

MANHATTAN        3215798
NaN               503299
QUEENS            491282
BROOKLYN          415033
BRONX             229641
OTHER             106566
RICHMOND           60339
WESTCHESTER         4441
ULSTER              2567
SULLIVAN            1067
DELAWARE             714
NASSAU               324
PUTNAM               322
SCHOHARIE            232
DUTCHESS             194
ALBANY               117
GREENE                79
WASHINGTON DC         56
ORANGE                23
Name: Work Location Borough, dtype: int64

In [46]:
df['Work Location Borough'].value_counts(dropna=False)

MANHATTAN        3215798
UNKNOWN           503299
QUEENS            491282
BROOKLYN          415033
BRONX             229641
OTHER             106566
RICHMOND           60339
WESTCHESTER         4441
ULSTER              2567
SULLIVAN            1067
DELAWARE             714
NASSAU               324
PUTNAM               322
SCHOHARIE            232
DUTCHESS             194
ALBANY               117
GREENE                79
WASHINGTON DC         56
ORANGE                23
Name: Work Location Borough, dtype: int64

In [55]:
fiveboro = ["MANHATTAN","BROOKLYN","QUEENS","BRONX","RICHMOND","UNKNOWN"]
df_fiveboroughs=df[df['Work Location Borough'].isin(fiveboro)]

#df_nonullname=df[df['null_name'] !='true']

In [56]:
df_fiveboroughs.shape

(4915392, 20)

In [57]:
df_fiveboroughs.head()

,Unnamed: 0,Fiscal Year,Payroll Number,Agency Name,Last Name,First Name,Mid Init,Agency Start Date,Work Location Borough,Title Description,Leave Status as of June 30,Base Salary,Pay Basis,Regular Hours,Regular Gross Paid,OT Hours,Total OT Paid,Total Other Pay,dup_row,null_name
0,0,2020,17,OFFICE OF EMERGENCY MANAGEMENT,BEREZIN,MIKHAIL,NaN,08/10/2015,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,False,NaN
1,1,2020,17,OFFICE OF EMERGENCY MANAGEMENT,GEAGER,VERONICA,M,09/12/2016,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,False,NaN
2,2,2020,17,OFFICE OF EMERGENCY MANAGEMENT,RAMANI,SHRADDHA,NaN,02/22/2016,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,False,NaN
3,3,2020,17,OFFICE OF EMERGENCY MANAGEMENT,ROTTA,JONATHAN,D,09/16/2013,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,False,NaN
4,4,2020,17,OFFICE OF EMERGENCY MANAGEMENT,WILSON II,ROBERT,P,04/30/2018,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,False,NaN

In [59]:
df_fiveboro_small=df_fiveboroughs.drop(columns=['dup_row','null_name'])

In [60]:
df_fiveboro_small.shape

(4915392, 18)

In [61]:
#export to csv as checkpoint
df_fiveboro_small.to_csv(os.path.join(preparedDataPath, 'payroll_fiveboro.csv'))

#checkpoint halt and close

In [3]:
#create dataframe with dataset from fiveboro
df=pd.read_csv(os.path.join(preparedDataPath, 'payroll_fiveboro.csv'),dtype=str)

In [4]:
df.head()

,Unnamed: 0.1,Unnamed: 0,Fiscal Year,Payroll Number,Agency Name,Last Name,First Name,Mid Init,Agency Start Date,Work Location Borough,Title Description,Leave Status as of June 30,Base Salary,Pay Basis,Regular Hours,Regular Gross Paid,OT Hours,Total OT Paid,Total Other Pay
0,0,0,2020,17,OFFICE OF EMERGENCY MANAGEMENT,BEREZIN,MIKHAIL,NaN,08/10/2015,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0
1,1,1,2020,17,OFFICE OF EMERGENCY MANAGEMENT,GEAGER,VERONICA,M,09/12/2016,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0
2,2,2,2020,17,OFFICE OF EMERGENCY MANAGEMENT,RAMANI,SHRADDHA,NaN,02/22/2016,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0
3,3,3,2020,17,OFFICE OF EMERGENCY MANAGEMENT,ROTTA,JONATHAN,D,09/16/2013,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0
4,4,4,2020,17,OFFICE OF EMERGENCY MANAGEMENT,WILSON II,ROBERT,P,04/30/2018,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0

#fix this [stupid] dtype problem

In [17]:
df = df.astype({"Base Salary":'float64', "Regular Hours":'float64', "Regular Gross Paid":'float64', "OT Hours":'float64', "Total OT Paid":'float64', "Total Other Pay":'float64', "Agency Name":'str'   }) 
df.dtypes

#,,

Unnamed: 0.1                   object
Unnamed: 0                     object
Fiscal Year                    object
Payroll Number                 object
Agency Name                    object
Last Name                      object
First Name                     object
Mid Init                       object
Agency Start Date              object
Work Location Borough          object
Title Description              object
Leave Status as of June 30     object
Base Salary                   float64
Pay Basis                      object
Regular Hours                 float64
Regular Gross Paid            float64
OT Hours                      float64
Total OT Paid                 float64
Total Other Pay               float64
dtype: object

In [16]:
#export with proper data types
df.to_csv(os.path.join(preparedDataPath, 'payroll_dtype.csv'))

In [18]:
#checkpoint close and halt

In [17]:
#create dataframe with dataset with correct dtype
df=pd.read_csv(os.path.join(preparedDataPath, 'payroll_dtype.csv'))

In [18]:
df.head()

,Unnamed: 0.2,Unnamed: 0.1,Unnamed: 0,Fiscal Year,Payroll Number,Agency Name,Last Name,First Name,Mid Init,Agency Start Date,Work Location Borough,Title Description,Leave Status as of June 30,Base Salary,Pay Basis,Regular Hours,Regular Gross Paid,OT Hours,Total OT Paid,Total Other Pay
0,0,0,0,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,BEREZIN,MIKHAIL,NaN,08/10/2015,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0
1,1,1,1,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,GEAGER,VERONICA,M,09/12/2016,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0
2,2,2,2,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,RAMANI,SHRADDHA,NaN,02/22/2016,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0
3,3,3,3,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,ROTTA,JONATHAN,D,09/16/2013,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0
4,4,4,4,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,WILSON II,ROBERT,P,04/30/2018,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4915392 entries, 0 to 4915391
Data columns (total 20 columns):
 #   Column                      Dtype
---  ------                      -----
 0   Unnamed: 0.2                int64
 1   Unnamed: 0.1                int64
 2   Unnamed: 0                  int64
 3   Fiscal Year                 int64
 4   Payroll Number              float64
 5   Agency Name                 object
 6   Last Name                   object
 7   First Name                  object
 8   Mid Init                    object
 9   Agency Start Date           object
 10  Work Location Borough       object
 11  Title Description           object
 12  Leave Status as of June 30  object
 13  Base Salary                 float64
 14  Pay Basis                   object
 15  Regular Hours               float64
 16  Regular Gross Paid          float64
 17  OT Hours                    float64
 18  Total OT Paid               float64
 19  Total Other Pay             float64
dtypes: float64(7), int64(4), object(9)
memory usage: 750.0+ MB

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4915389 entries, 3 to 4915391
Data columns (total 20 columns):
 #   Column                      Dtype
---  ------                      -----
 0   Unnamed: 0.2                int64
 1   Unnamed: 0.1                int64
 2   Unnamed: 0                  int64
 3   Fiscal Year                 int64
 4   Payroll Number              float64
 5   Agency Name                 object
 6   Last Name                   object
 7   First Name                  object
 8   Mid Init                    object
 9   Agency Start Date           object
 10  Work Location Borough       object
 11  Title Description           object
 12  Leave Status as of June 30  object
 13  Base Salary                 float64
 14  Pay Basis                   object
 15  Regular Hours               float64
 16  Regular Gross Paid          float64
 17  OT Hours                    float64
 18  Total OT Paid               float64
 19  Total Other Pay             float64
dtypes: float64(7), int64(4), object(9)
memory usage: 750.0+ MB

### Continue searching for nulls

In [20]:
df['Title Description'].isnull().sum()

55

In [21]:
#subset to no nulls
df_title=df[df['Title Description'].notnull()]

In [22]:
df_title.shape

(4915337, 20)

In [23]:
4915392-55

4915337

In [24]:
#export to csv
df_title.to_csv(os.path.join(preparedDataPath, 'payroll_title.csv'))

#checkpoint and halt

In [3]:
#create dataframe with dataset from good title data, cut extra index columns
goodcols=["Fiscal Year","Payroll Number","Agency Name","Last Name","First Name","Mid Init","Agency Start Date","Work Location Borough","Title Description","Leave Status as of June 30","Base Salary","Pay Basis","Regular Hours","Regular Gross Paid","OT Hours","Total OT Paid","Total Other Pay"]
df=pd.read_csv(os.path.join(preparedDataPath,'payroll_title.csv'),usecols=goodcols)

In [4]:
df.head()

,Fiscal Year,Payroll Number,Agency Name,Last Name,First Name,Mid Init,Agency Start Date,Work Location Borough,Title Description,Leave Status as of June 30,Base Salary,Pay Basis,Regular Hours,Regular Gross Paid,OT Hours,Total OT Paid,Total Other Pay
0,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,BEREZIN,MIKHAIL,NaN,08/10/2015,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0
1,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,GEAGER,VERONICA,M,09/12/2016,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0
2,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,RAMANI,SHRADDHA,NaN,02/22/2016,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0
3,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,ROTTA,JONATHAN,D,09/16/2013,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0
4,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,WILSON II,ROBERT,P,04/30/2018,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0

In [5]:
df.shape

(4915337, 17)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4915337 entries, 0 to 4915336
Data columns (total 17 columns):
 #   Column                      Dtype
---  ------                      -----
 0   Fiscal Year                 int64
 1   Payroll Number              float64
 2   Agency Name                 object
 3   Last Name                   object
 4   First Name                  object
 5   Mid Init                    object
 6   Agency Start Date           object
 7   Work Location Borough       object
 8   Title Description           object
 9   Leave Status as of June 30  object
 10  Base Salary                 float64
 11  Pay Basis                   object
 12  Regular Hours               float64
 13  Regular Gross Paid          float64
 14  OT Hours                    float64
 15  Total OT Paid               float64
 16  Total Other Pay             float64
dtypes: float64(7), int64(1), object(9)
memory usage: 637.5+ MB

In [7]:
df = df.astype({"Fiscal Year":'str', "Payroll Number":'str' }) 
df.dtypes

Fiscal Year                    object
Payroll Number                 object
Agency Name                    object
Last Name                      object
First Name                     object
Mid Init                       object
Agency Start Date              object
Work Location Borough          object
Title Description              object
Leave Status as of June 30     object
Base Salary                   float64
Pay Basis                      object
Regular Hours                 float64
Regular Gross Paid            float64
OT Hours                      float64
Total OT Paid                 float64
Total Other Pay               float64
dtype: object

#create unique identifier for employees

In [44]:
import random, string

In [45]:
def randomword(length):
    letters = string.ascii_lowercase
    return ''.join(random.choice(letters) for i in range(length))

In [25]:
randomword(8)

'illytaol'

In [8]:
df['First Name']=df['First Name'].fillna(value="%")

In [35]:
df['First Name'].value_counts(dropna=False)

MICHAEL           74642
JOHN              47700
JOSEPH            41069
MARIA             38704
ROBERT            38694
                  ...
JIAMO                 1
JINGPING DANNY        1
KOKOSHEN              1
MIAO JI               1
LAMONA                1
Name: First Name, Length: 97762, dtype: int64

In [9]:
df['Last Name']=df['Last Name'].fillna(value="%")

In [10]:
df['Mid Init']=df['Mid Init'].fillna(value="%")

In [11]:
df['fullname_date'] = df['First Name'] + df['Mid Init'] + df['Last Name'] + df['Agency Start Date']

In [17]:
df['fullname'].duplicated()

0          False
1          False
2           True
3          False
4          False
           ...
4915332     True
4915333     True
4915334     True
4915335     True
4915336     True
Name: fullname, Length: 4915337, dtype: bool

In [12]:
df['fullname_date'].value_counts(dropna=False)

AMANDA%HALL08/30/2000             41
LIANA%ERSTENYUK05/03/2010         38
JULIEMVEGA02/27/1988              37
SUSANGNERI-FRIEDWALD10/10/2007    36
YEVGENIY%MILMAN01/28/2010         35
                                  ..
KIMBERLYJBAYER01/19/2010           1
RYANMWHALEN01/25/2010              1
MICHAELEPOWELL JR02/22/2010        1
HOWARDLWOLFSON03/01/2010           1
JULIALZITA08/23/2021               1
Name: fullname_date, Length: 969930, dtype: int64

In [40]:
#export to csv with new fullname_date
df.to_csv(os.path.join(preparedDataPath, 'payroll_fullnamedate.csv'))

In [66]:
#create dataframe with dataset from good title data, cut extra index columns
goodcols=["fullname_date"]
df=pd.read_csv(os.path.join(preparedDataPath,'payroll_fullnamedate.csv'),usecols=goodcols)

In [67]:
df.shape

(4915337, 1)

In [68]:
df=df.drop_duplicates()

In [69]:
df.shape

(969930, 1)

In [70]:
df['unique_id'] = [randomword(8) for _ in range(len(df.index))]

In [71]:
df.head()

                fullname_date unique_id
0   MIKHAIL%BEREZIN08/10/2015  emgiazxy
1   VERONICAMGEAGER09/12/2016  qcekinkp
2   SHRADDHA%RAMANI02/22/2016  vihcvktl
3    JONATHANDROTTA09/16/2013  ototwwxb
4  ROBERTPWILSON II04/30/2018  oskpiihm

#Export Employee Lookup Table to seperate CSV file

In [72]:
#export to csv
df.to_csv(os.path.join(preparedDataPath, 'employee_lookup.csv'))

#close and halt
major checkpoint
when reopen
-import payroll_fullnamedate.csv
-import employee_lookup.csv
use merge function to add employee identifier to original data set
example: pd.merge(restaurant_ids_dataframe, restaurant_review_frame, on='business_id', how='outer')

Note:  Merge function did not work as expected, must try again.

In [4]:
df_full=pd.read_csv(os.path.join(preparedDataPath,'payroll_fullnamedate.csv'))
df_employeelookup=pd.read_csv(os.path.join(preparedDataPath,'employee_lookup.csv'))

In [5]:
df_full.head()

,Unnamed: 0,Fiscal Year,Payroll Number,Agency Name,Last Name,First Name,Mid Init,Agency Start Date,Work Location Borough,Title Description,Leave Status as of June 30,Base Salary,Pay Basis,Regular Hours,Regular Gross Paid,OT Hours,Total OT Paid,Total Other Pay,fullname_date
0,0,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,BEREZIN,MIKHAIL,%,08/10/2015,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,MIKHAIL%BEREZIN08/10/2015
1,1,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,GEAGER,VERONICA,M,09/12/2016,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,VERONICAMGEAGER09/12/2016
2,2,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,RAMANI,SHRADDHA,%,02/22/2016,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,SHRADDHA%RAMANI02/22/2016
3,3,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,ROTTA,JONATHAN,D,09/16/2013,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,JONATHANDROTTA09/16/2013
4,4,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,WILSON II,ROBERT,P,04/30/2018,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,ROBERTPWILSON II04/30/2018

In [7]:
df_full.shape

(4915337, 19)

In [8]:
df_employeelookup.head()

   Unnamed: 0               fullname_date unique_id
0           0   MIKHAIL%BEREZIN08/10/2015  emgiazxy
1           1   VERONICAMGEAGER09/12/2016  qcekinkp
2           2   SHRADDHA%RAMANI02/22/2016  vihcvktl
3           3    JONATHANDROTTA09/16/2013  ototwwxb
4           4  ROBERTPWILSON II04/30/2018  oskpiihm

In [9]:
df_employeelookup.shape

(969930, 3)

In [12]:
df_merge= pd.merge(df_full, df_employeelookup, on='fullname_date', how='left')

In [13]:
df_merge.head()

,Unnamed: 0_x,Fiscal Year,Payroll Number,Agency Name,Last Name,First Name,Mid Init,Agency Start Date,Work Location Borough,Title Description,...,Base Salary,Pay Basis,Regular Hours,Regular Gross Paid,OT Hours,Total OT Paid,Total Other Pay,fullname_date,Unnamed: 0_y,unique_id
0,0,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,BEREZIN,MIKHAIL,%,08/10/2015,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,...,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,MIKHAIL%BEREZIN08/10/2015,0,emgiazxy
1,1,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,GEAGER,VERONICA,M,09/12/2016,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,...,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,VERONICAMGEAGER09/12/2016,1,qcekinkp
2,2,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,RAMANI,SHRADDHA,%,02/22/2016,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,...,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,SHRADDHA%RAMANI02/22/2016,2,vihcvktl
3,3,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,ROTTA,JONATHAN,D,09/16/2013,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,...,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,JONATHANDROTTA09/16/2013,3,ototwwxb
4,4,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,WILSON II,ROBERT,P,04/30/2018,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,...,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,ROBERTPWILSON II04/30/2018,4,oskpiihm

In [14]:
#export to csv
df_merge.to_csv(os.path.join(preparedDataPath, 'payroll_full_uniqueid.csv'))

In [5]:
#create dataframe with dataset from good title data, cut extra index columns
goodcols=["Fiscal Year","Payroll Number","Agency Name","Last Name","First Name","Mid Init","Agency Start Date","Work Location Borough","Title Description","Leave Status as of June 30","Base Salary","Pay Basis","Regular Hours","Regular Gross Paid","OT Hours","Total OT Paid","Total Other Pay","unique_id"]
df=pd.read_csv(os.path.join(preparedDataPath,'payroll_full_uniqueid.csv'),usecols=goodcols)

In [6]:
df.head()

,Fiscal Year,Payroll Number,Agency Name,Last Name,First Name,Mid Init,Agency Start Date,Work Location Borough,Title Description,Leave Status as of June 30,Base Salary,Pay Basis,Regular Hours,Regular Gross Paid,OT Hours,Total OT Paid,Total Other Pay,unique_id
0,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,BEREZIN,MIKHAIL,%,08/10/2015,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,emgiazxy
1,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,GEAGER,VERONICA,M,09/12/2016,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,qcekinkp
2,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,RAMANI,SHRADDHA,%,02/22/2016,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,vihcvktl
3,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,ROTTA,JONATHAN,D,09/16/2013,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,ototwwxb
4,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,WILSON II,ROBERT,P,04/30/2018,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,oskpiihm

In [7]:
df.shape

(4915337, 18)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4915337 entries, 0 to 4915336
Data columns (total 18 columns):
 #   Column                      Dtype
---  ------                      -----
 0   Fiscal Year                 int64
 1   Payroll Number              float64
 2   Agency Name                 object
 3   Last Name                   object
 4   First Name                  object
 5   Mid Init                    object
 6   Agency Start Date           object
 7   Work Location Borough       object
 8   Title Description           object
 9   Leave Status as of June 30  object
 10  Base Salary                 float64
 11  Pay Basis                   object
 12  Regular Hours               float64
 13  Regular Gross Paid          float64
 14  OT Hours                    float64
 15  Total OT Paid               float64
 16  Total Other Pay             float64
 17  unique_id                   object
dtypes: float64(7), int64(1), object(10)
memory usage: 675.0+ MB

In [9]:
df.describe()

,Fiscal Year,Payroll Number,Base Salary,Regular Hours,Regular Gross Paid,OT Hours,Total OT Paid,Total Other Pay
count,4.915337e+06,3.234063e+06,4.915337e+06,4.915337e+06,4.915337e+06,4.915337e+06,4.915337e+06,4.915337e+06
mean,2.018074e+03,5.736013e+02,4.231114e+04,6.705228e+02,4.166508e+04,6.448972e+01,3.409022e+03,2.954736e+03
std,2.577118e+00,3.008655e+02,4.194309e+04,8.886410e+02,3.953947e+04,1.663559e+02,9.521246e+03,5.727339e+03
min,2.014000e+03,2.000000e+00,1.000000e-02,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,2.016000e+03,3.000000e+02,3.318000e+01,0.000000e+00,3.131120e+03,0.000000e+00,0.000000e+00,0.000000e+00
50%,2.018000e+03,7.420000e+02,4.100300e+04,0.000000e+00,3.518840e+04,0.000000e+00,0.000000e+00,4.311000e+01
75%,2.020000e+03,7.470000e+02,7.656500e+04,1.820000e+03,7.363837e+04,1.500000e+00,1.496900e+02,3.389850e+03
max,2.022000e+03,9.960000e+02,4.147070e+05,4.171430e+03,6.723089e+05,3.692900e+03,2.559999e+05,6.500000e+05

#import again and omit employee name variables

In [4]:
goodcols=["Fiscal Year","Payroll Number","Agency Name","Agency Start Date","Work Location Borough","Title Description","Leave Status as of June 30","Base Salary","Pay Basis","Regular Hours","Regular Gross Paid","OT Hours","Total OT Paid","Total Other Pay","unique_id"]
df=pd.read_csv(os.path.join(preparedDataPath,'payroll_full_uniqueid.csv'),usecols=goodcols)

In [11]:
df.head()

,Fiscal Year,Payroll Number,Agency Name,Agency Start Date,Work Location Borough,Title Description,Leave Status as of June 30,Base Salary,Pay Basis,Regular Hours,Regular Gross Paid,OT Hours,Total OT Paid,Total Other Pay,unique_id
0,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,08/10/2015,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,emgiazxy
1,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,09/12/2016,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,qcekinkp
2,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,02/22/2016,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,vihcvktl
3,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,09/16/2013,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,ototwwxb
4,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,04/30/2018,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,oskpiihm

In [5]:
#rename unqiue_id column to employee_id
df.rename(columns = {'unique_id' : 'employee_id'}, inplace = True)

In [6]:
df.head()

,Fiscal Year,Payroll Number,Agency Name,Agency Start Date,Work Location Borough,Title Description,Leave Status as of June 30,Base Salary,Pay Basis,Regular Hours,Regular Gross Paid,OT Hours,Total OT Paid,Total Other Pay,employee_id
0,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,08/10/2015,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,emgiazxy
1,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,09/12/2016,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,qcekinkp
2,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,02/22/2016,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,vihcvktl
3,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,09/16/2013,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,ototwwxb
4,2020,17.0,OFFICE OF EMERGENCY MANAGEMENT,04/30/2018,BROOKLYN,EMERGENCY PREPAREDNESS MANAGER,ACTIVE,86005.0,per Annum,1820.0,84698.21,0.0,0.0,0.0,oskpiihm

In [7]:
df.shape

(4915337, 15)

In [8]:
df.describe()

,Fiscal Year,Payroll Number,Base Salary,Regular Hours,Regular Gross Paid,OT Hours,Total OT Paid,Total Other Pay
count,4.915337e+06,3.234063e+06,4.915337e+06,4.915337e+06,4.915337e+06,4.915337e+06,4.915337e+06,4.915337e+06
mean,2.018074e+03,5.736013e+02,4.231114e+04,6.705228e+02,4.166508e+04,6.448972e+01,3.409022e+03,2.954736e+03
std,2.577118e+00,3.008655e+02,4.194309e+04,8.886410e+02,3.953947e+04,1.663559e+02,9.521246e+03,5.727339e+03
min,2.014000e+03,2.000000e+00,1.000000e-02,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,2.016000e+03,3.000000e+02,3.318000e+01,0.000000e+00,3.131120e+03,0.000000e+00,0.000000e+00,0.000000e+00
50%,2.018000e+03,7.420000e+02,4.100300e+04,0.000000e+00,3.518840e+04,0.000000e+00,0.000000e+00,4.311000e+01
75%,2.020000e+03,7.470000e+02,7.656500e+04,1.820000e+03,7.363837e+04,1.500000e+00,1.496900e+02,3.389850e+03
max,2.022000e+03,9.960000e+02,4.147070e+05,4.171430e+03,6.723089e+05,3.692900e+03,2.559999e+05,6.500000e+05

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4915337 entries, 0 to 4915336
Data columns (total 15 columns):
 #   Column                      Dtype
---  ------                      -----
 0   Fiscal Year                 int64
 1   Payroll Number              float64
 2   Agency Name                 object
 3   Agency Start Date           object
 4   Work Location Borough       object
 5   Title Description           object
 6   Leave Status as of June 30  object
 7   Base Salary                 float64
 8   Pay Basis                   object
 9   Regular Hours               float64
 10  Regular Gross Paid          float64
 11  OT Hours                    float64
 12  Total OT Paid               float64
 13  Total Other Pay             float64
 14  employee_id                 object
dtypes: float64(7), int64(1), object(7)
memory usage: 562.5+ MB

In [16]:
#save clean data as csv ready for analysis
df.to_csv(os.path.join(preparedDataPath, 'payroll_clean.csv'))

In [10]:
df.duplicated()

0          False
1          False
2          False
3          False
4          False
           ...
4915332    False
4915333    False
4915334    False
4915335    False
4915336    False
Length: 4915337, dtype: bool

In [14]:
df.isnull()

,Fiscal Year,Payroll Number,Agency Name,Agency Start Date,Work Location Borough,Title Description,Leave Status as of June 30,Base Salary,Pay Basis,Regular Hours,Regular Gross Paid,OT Hours,Total OT Paid,Total Other Pay,employee_id
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4915332,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4915333,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4915334,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4915335,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4915336,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

In [15]:
df['Leave Status as of June 30'].value_counts(dropna=False)

ACTIVE                 4202676
CEASED                  606303
ON LEAVE                 55462
SEASONAL                 42113
ON SEPARATION LEAVE       8783
Name: Leave Status as of June 30, dtype: int64